In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'Class':[1,1,2,2],
                   'Name':['San Zhang','San Zhang','Si Li','Si Li'],
                   'Subject':['Chinese','Math','Chinese','Math'],
                   'Grade':[80,75,90,85]})

In [3]:
df

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      1  San Zhang     Math     75
2      2      Si Li  Chinese     90
3      2      Si Li     Math     85

In [4]:
df = pd.DataFrame(np.ones((4,2)),
                  index = pd.Index([('A', 'cat', 'big'),
                                    ('A', 'dog', 'small'),
                                    ('B', 'cat', 'big'),
                                    ('B', 'dog', 'small')]),
                  columns=['col_1', 'col_2'])
df

             col_1  col_2
A cat big      1.0    1.0
  dog small    1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [8]:
df.unstack().stack().equals(df)

True

In [12]:
df.unstack([1,2]).stack([1,2]).equals(df)

True

In [13]:
df_ex = pd.DataFrame({'A': [[1, 2],
                         'my_str',
                         {1, 2},
                         pd.Series([3, 4])],
                      'B': 1})
df_ex

                            A  B
0                      [1, 2]  1
1                      my_str  1
2                      {1, 2}  1
3  0    3
1    4
dtype: int64  1

In [14]:
df_ex.explode('A')

        A  B
0       1  1
0       2  1
1  my_str  1
2       1  1
2       2  1
3       3  1
3       4  1

In [17]:
df = pd.read_csv('data/learn_pandas.csv')

In [18]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [19]:
pd.get_dummies(df.Grade).head()

   Freshman  Junior  Senior  Sophomore
0         1       0       0          0
1         1       0       0          0
2         0       0       1          0
3         0       0       0          1
4         0       0       0          1

In [20]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'],
                    'Age':[20,30]})
df2 = pd.DataFrame({'Name':['Si Li','Wu Wang'],
                    'Gender':['F','M']})

In [21]:
df1

        Name  Age
0  San Zhang   20
1      Si Li   30

In [22]:
df2

      Name Gender
0    Si Li      F
1  Wu Wang      M

In [23]:
df1.merge(df2, on='Name', how='left')

        Name  Age Gender
0  San Zhang   20    NaN
1      Si Li   30      F

In [24]:
df1.merge(df2, on='Name', how='right')

      Name   Age Gender
0    Si Li  30.0      F
1  Wu Wang   NaN      M

In [25]:
df1.merge(df2, on='Name', how='inner')

    Name  Age Gender
0  Si Li   30      F

In [26]:
df1.merge(df2, on='Name', how='outer')

        Name   Age Gender
0  San Zhang  20.0    NaN
1      Si Li  30.0      F
2    Wu Wang   NaN      M

In [27]:
df1 = pd.DataFrame({'df1_name':['San Zhang','Si Li'],
                    'Age':[20,30]})
df2 = pd.DataFrame({'df2_name':['Si Li','Wu Wang'],
                    'Gender':['F','M']})

In [29]:
df1

    df1_name  Age
0  San Zhang   20
1      Si Li   30

In [30]:
df2

  df2_name Gender
0    Si Li      F
1  Wu Wang      M

In [34]:
df1.merge(df2, left_on='df1_name', right_on='df2_name', how='outer')

    df1_name   Age df2_name Gender
0  San Zhang  20.0      NaN    NaN
1      Si Li  30.0    Si Li      F
2        NaN   NaN  Wu Wang      M

In [35]:
df1 = pd.DataFrame({'Name':['San Zhang'],'Grade':[70]})

df2 = pd.DataFrame({'Name':['San Zhang'],'Grade':[80]})

df1.merge(df2, on='Name', how='left', suffixes=['_Chinese','_Math'])

        Name  Grade_Chinese  Grade_Math
0  San Zhang             70          80

In [36]:
df1 = pd.DataFrame({'Name':['San Zhang', 'San Zhang'],
                    'Age':[20, 21],
                    'Class':['one', 'two']})
df2 = pd.DataFrame({'Name':['San Zhang', 'San Zhang'],
                    'Gender':['F', 'M'],
                    'Class':['two', 'one']})

In [37]:
df1

        Name  Age Class
0  San Zhang   20   one
1  San Zhang   21   two

In [38]:
df2

        Name Gender Class
0  San Zhang      F   two
1  San Zhang      M   one

In [39]:
df1.merge(df2, on='Name', how='left')

        Name  Age Class_x Gender Class_y
0  San Zhang   20     one      F     two
1  San Zhang   20     one      M     one
2  San Zhang   21     two      F     two
3  San Zhang   21     two      M     one

In [40]:
df1.merge(df2, on=['Name', 'Class'], how='left')

        Name  Age Class Gender
0  San Zhang   20   one      M
1  San Zhang   21   two      F

In [41]:
df1 = pd.DataFrame({'Age':[20,30]},
                    index=pd.Series(
                    ['San Zhang','Si Li'],name='Name'))
df2 = pd.DataFrame({'Gender':['F','M']},
                    index=pd.Series(
                    ['Si Li','Wu Wang'],name='Name'))

In [42]:
df1

           Age
Name
San Zhang   20
Si Li       30

In [43]:
df2

        Gender
Name
Si Li        F
Wu Wang      M

In [44]:
df1.join(df2, how='left')

           Age Gender
Name
San Zhang   20    NaN
Si Li       30      F

In [45]:
df1 = pd.DataFrame({'Grade':[70]},
                    index=pd.Series(['San Zhang'],
                    name='Name'))
df2 = pd.DataFrame({'Grade':[80]},
                    index=pd.Series(['San Zhang'],
                    name='Name'))

In [46]:
df1

           Grade
Name
San Zhang     70

In [47]:
df2

           Grade
Name
San Zhang     80

In [49]:
df1.join(df2, how='left', lsuffix='_Chinese', rsuffix='_Math')

           Grade_Chinese  Grade_Math
Name
San Zhang             70          80

In [50]:
df1 = pd.DataFrame({'Age':[20,21]},
                    index=pd.MultiIndex.from_arrays(
                    [['San Zhang', 'San Zhang'],['one', 'two']],
                    names=('Name','Class')))
df2 = pd.DataFrame({'Gender':['F', 'M']},
                    index=pd.MultiIndex.from_arrays(
                    [['San Zhang', 'San Zhang'],['two', 'one']],
                    names=('Name','Class')))

In [51]:
df1

                 Age
Name      Class
San Zhang one     20
          two     21

In [52]:
df2

                Gender
Name      Class
San Zhang two        F
          one        M

In [53]:
df1.join(df2)

                 Age Gender
Name      Class
San Zhang one     20      M
          two     21      F

In [54]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'],
                    'Age':[20,30]})
df2 = pd.DataFrame({'Name':['Wu Wang'], 'Age':[40]})

In [55]:
df1

        Name  Age
0  San Zhang   20
1      Si Li   30

In [56]:
df2

      Name  Age
0  Wu Wang   40

In [57]:
pd.concat([df1, df2])

        Name  Age
0  San Zhang   20
1      Si Li   30
0    Wu Wang   40

In [58]:
df2 = pd.DataFrame({'Grade':[80, 90]})
df3 = pd.DataFrame({'Gender':['M', 'F']})

In [59]:
df1

        Name  Age
0  San Zhang   20
1      Si Li   30

In [60]:
df2

   Grade
0     80
1     90

In [62]:
df3

  Gender
0      M
1      F

In [61]:
pd.concat([df1, df2, df3], 1)

        Name  Age  Grade Gender
0  San Zhang   20     80      M
1      Si Li   30     90      F

In [63]:
df2 = pd.DataFrame({'Name':['Wu Wang'], 'Gender':['M']})
pd.concat([df1, df2])

        Name   Age Gender
0  San Zhang  20.0    NaN
1      Si Li  30.0    NaN
0    Wu Wang   NaN      M

In [73]:
df2 = pd.DataFrame({'Age':[80, 90]}, index=[3, 2])
pd.concat([df1, df2], 0)

        Name  Age
0  San Zhang   20
1      Si Li   30
3        NaN   80
2        NaN   90

In [74]:
s = pd.Series(['Wu Wang', 21], index = df1.columns)

In [78]:
s.name = 2

In [79]:
df1.append(s)

        Name  Age
0  San Zhang   20
1      Si Li   30
2    Wu Wang   21

In [80]:
s = pd.Series([80, 90])
df1.assign(Grade=s)

        Name  Age  Grade
0  San Zhang   20     80
1      Si Li   30     90

In [81]:
df1['Grade'] = s
df1

        Name  Age  Grade
0  San Zhang   20     80
1      Si Li   30     90

In [82]:
df1 = pd.DataFrame({'Name':['San Zhang', 'Si Li', 'Wu Wang'],
                        'Age':[20, 21 ,21],
                        'Class':['one', 'two', 'three']})
df2 = pd.DataFrame({'Name':['San Zhang', 'Li Si', 'Wu Wang'],
                        'Age':[20, 21 ,21],
                        'Class':['one', 'two', 'Three']})

In [83]:
df1

        Name  Age  Class
0  San Zhang   20    one
1      Si Li   21    two
2    Wu Wang   21  three

In [84]:
df2

        Name  Age  Class
0  San Zhang   20    one
1      Li Si   21    two
2    Wu Wang   21  Three

In [85]:
df1.compare(df2)

    Name         Class
    self  other   self  other
1  Si Li  Li Si    NaN    NaN
2    NaN    NaN  three  Three

In [86]:
df1.compare(df2, keep_shape=True)

    Name         Age        Class
    self  other self other   self  other
0    NaN    NaN  NaN   NaN    NaN    NaN
1  Si Li  Li Si  NaN   NaN    NaN    NaN
2    NaN    NaN  NaN   NaN  three  Three

In [109]:
def choose_min(s1, s2):
    s2 = s2.reindex_like(s1)
    res = s1.where(s1<s2, s2)
    res = res.mask(s1.isna()) # isnaè¡¨ç¤ºæ˜¯å¦ä¸ºç¼ºå¤±å€¼ï¼Œè¿”å›žå¸ƒå°”åºåˆ—
    return res

In [88]:
df1 = pd.DataFrame({'A':[1,2], 'B':[3,4], 'C':[5,6]})
df2 = pd.DataFrame({'B':[5,6], 'C':[7,8], 'D':[9,10]}, index=[1,2])

In [89]:
df1

   A  B  C
0  1  3  5
1  2  4  6

In [90]:
df2

   B  C   D
1  5  7   9
2  6  8  10

In [110]:
df1.combine(df2, choose_min)

    A    B    C   D
0 NaN  NaN  NaN NaN
1 NaN  4.0  6.0 NaN
2 NaN  NaN  NaN NaN

In [111]:
df1 = pd.DataFrame({'A':[1,2], 'B':[3,np.nan]})
df2 = pd.DataFrame({'A':[5,6], 'B':[7,8]}, index=[1,2])

In [112]:
df1

   A    B
0  1  3.0
1  2  NaN

In [113]:
df2

   A  B
1  5  7
2  6  8

In [114]:
df1.combine_first(df2)

     A    B
0  1.0  3.0
1  2.0  7.0
2  6.0  8.0